Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh11-v3.tmx
Source language: bo
Languages: en

source: འདུ་བྱེད་འགགས་པས་རྣམ་པར་ཤེས་པ་འགག །
en: Through the cessation of formative predispositions, consciousness ceases.

source: རྣམ་པར་ཤེས་པ་འགགས་པས་མིང་དང་གཟུགས་འགག །
en: Through the cessation of consciousness, name and form cease.

source: མིང་དང་གཟུགས་འགགས་པས་སྐྱེ་མཆེད་དྲུག་འགག །
en: Through the cessation of name and form, the six sense fields cease.

source: སྐྱེ་མཆེད་དྲུག་འགགས་པས་རེག་པ་འགག །
en: Through the cessation of the six sense fields, sensory contact ceases.

source: རེག་པ་འགགས་པས་ཚོར་བ་འགག །
en: Through the cessation of sensory contact, sensation ceases.

source: ཚོར་བ་འགགས་པས་སྲེད་པ་འགག །
en: Through the cessation of sensation, craving ceases.

source: སྲེད་པ་འགགས་པས་ལེན་པ་འགག །
en: Through the cessation of craving, grasping ceases.

source: ལེན་པ་འགགས་པས་སྲིད་པ་འགག །
en: Through the cessation of grasping, the rebirth process ceases.

source: སྲིད་པ་འགགས་པས་སྐྱེ་བ་འགག །
en: Through the cessation of the rebirth process, actual birth ceases.

source: སྐྱེ་བ་འགགས་པས་རྒ་ཤི་འགག །རྒ་ཤི་འགགས་པས་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་།
en: Through the cessation of actual birth, aging and death cease; and through the cessation of aging and death, sorrow, lamentation, suffering, mental discomfort, and agitation all cease.

source: འཁྲུགས་པ་རྣམས་འགག་པར་འགྱུར་ཏེ། དེ་ལྟར་ན་སྡུག་བསྔལ་གྱི་ཕུང་པོ་འབའ་ཞིག་པོ་འདི་དག་འགག་པར་གྱུར་ཏེ།
en: It is in this way that these corporeal aggregates, exclusively endowed with suffering, cease.

source: དེ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཡན་ལག་བཅུ་གཉིས་པ་ལུགས་དང་འཐུན་པ་དང་། ལུགས་དང་མི་འཐུན་པ་ཞེས་བྱའོ། །
en: “These two processes are respectively said to follow and reverse the sequence in which the twelve links of dependent origination arise.

source: དེ་ལ་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཚོར་བ་ལ་ཚོར་བའི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་དང་།
en: “If you ask what are the ‘four applications of mindfulness,’ they comprise (1) the application of mindfulness which, with regard to the physical body, observes the physical body; (2) the application of mindfulness which, with regard to feelings, observes feelings; (3) the application of mindfulness which, with regard to the mind, observes the mind; and (4) the application of mindfulness which, with regard to phenomena, observes phenomena.

source: ཆོས་ལ་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་བའི་དྲན་པ་ཉེ་བར་གཞག་པ་སྟེ། དེ་དག་ནི་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཞེས་བྱའོ། །
en: These are called the four applications of mindfulness.

source: དེ་ལ་ཡང་དག་པར་སྤོང་བ་བཞི་གང་ཞེ་ན། འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤང་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ། སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་དང་། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་གནས་པ་དང་། མི་བརྗེད་པ་དང་། ཤིན་ཏུ་རྒྱས་པ་དང་། ཕྱིར་ཞིང་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་འདུན་པ་སྐྱེད་ཅིང་འབད་ལ་བརྩོན་འགྲུས་རྩོམ་སྟེ།
en: “If you ask what are the ‘four correct exertions,’ (1) great bodhisattva beings resolve, struggle, strive, persevere with tenacity, and rightly aspire that negative and non-virtuous attributes which have not yet arisen might not be developed; (2) they resolve, struggle, strive, persevere with tenacity, and rightly aspire that negative and non-virtuous attributes which have previously arisen might be renounced; (3) they resolve, struggle, strive, persevere with tenacity, and rightly aspire that virtuous attributes which have not yet arisen might be developed; and (4) they resolve, struggle, strive, persevere with tenacity, and rightly aspire that virtuous attributes which have previously arisen might remain, be unforgotten, flourish, and reach complete perfection in the future, through cultivation.

source: སེམས་རབ་ཏུ་འཛིན་ཅིང་ཡང་དག་པར་རབ་ཏུ་འཇོག་པ་སྟེ། དེ་དག་ནི་ཡང་དག་པའི་སྤོང་བ་བཞི་ཞེས་བྱའོ། །
en: These are called the four correct exertions.

source: དེ་ལ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདུན་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། སེམས་ཀྱི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་།
en: “If you ask what are the ‘four supports for miraculous abilities,’ they comprise (1) the support for miraculous ability combining the meditative stability of resolution with the formative force of exertion, (2) the support for miraculous ability combining the meditative stability of perseverance with the formative force of exertion, (3) the support for miraculous ability combining the meditative stability of mind with the formative force of exertion, and (4) the support for miraculous ability combining the meditative stability of scrutiny with the formative force of exertion.

source: དཔྱོད་པའི་ཏིང་ངེ་འཛིན་སྤོང་བའི་འདུ་བྱེད་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྟེ། དེ་དག་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་ཞེས་བྱའོ། །
en: These are called the four supports for miraculous ability.

source: དེ་ལ་དབང་པོ་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དད་པའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་།
en: “If you ask what are the ‘five faculties,’ they comprise (1) the faculty of faith, (2) the faculty of perseverance, (3) the faculty of recollection, (4) the faculty of meditative stability, and (5) the faculty of wisdom.

source: ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་སྟེ། དེ་དག་ནི་དབང་པོ་ལྔ་ཞེས་བྱའོ། །
en: These are called the five faculties.

source: དེ་ལ་སྟོབས་ལྔ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདི་བཞིན་དུ་དད་པའི་སྟོབས་དང་། བརྩོན་འགྲུས་ཀྱི་སྟོབས་དང་། དྲན་པའི་སྟོབས་དང་།
en: “If you ask what are the ‘five powers,’ they similarly comprise (1) the power of faith, (2) the power of perseverance, (3) the power of recollection, (4) the power of meditative stability, and (5) the power of wisdom.

source: ཏིང་ངེ་འཛིན་གྱི་སྟོབས་དང་། ཤེས་རབ་ཀྱི་སྟོབས་ཏེ། དེ་དག་ནི་སྟོབས་ལྔ་ཞེས་བྱའོ། །
en: These are called the five powers.

source: དེ་ལ་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་གང་ཞེ་ན། འདི་ལྟ་སྟེ། དྲན་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བརྩོན་འགྲུས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་།
en: “If you ask what are the ‘seven branches of enlightenment,’ they comprise (1) the branch of enlightenment that entails correct recollection, (2) the branch of enlightenment that entails correct doctrinal analysis, (3) the branch of enlightenment that entails correct perseverance, (4) the branch of enlightenment that entails correct delight, (5) the branch of enlightenment that entails correct mental and physical refinement, (6) the branch of enlightenment that entails correct meditative stability, and (7) the branch of enlightenment that entails correct equanimity.

source: ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་སྟེ། དེ་དག་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ཅེས་བྱའོ། །
en: These are called the seven branches of enlightenment.

source: དེ་ལ་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་།
en: “If you ask what is the ‘noble eightfold path,’ it comprises (1) correct view, (2) correct ideation, (3) correct speech, (4) correct action, (5) correct livelihood, (6) correct effort, (7) correct recollection, and (8) correct meditative stability.

source: ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏེ། དེ་དག་ནི་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཞེས་བྱའོ། །
en: These are the branches of the noble eightfold path.

source: དེ་ལ་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བར་སོ་སོར་རྟོག་པའི་སེམས་གནས་པ། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དེ།
en: “If you ask what is ‘emptiness as a gateway to liberation,’ the state of mind which discerns that all things are empty of their own defining characteristics is emptiness as a gateway to liberation.

source: དེ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་ཅེས་བྱའོ། །
en: This is called emptiness as a gateway to liberation.

source: དེ་ལ་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་མཚན་མ་མེད་པར་སོ་སོར་ཀུན་ཏུ་རྟོག་པའི་སེམས་གནས་པ། རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་སྟེ།
en: “If you ask what is ‘signlessness as a gateway to liberation,’ the state of mind which discerns in all respects that all things are signless in terms of their own defining characteristics is signlessness as a gateway to liberation.

source: དེ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་མཚན་མ་མེད་པ་ཞེས་བྱའོ། །
en: This is called signlessness as a gateway to liberation.

source: དེ་ལ་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལ། མངོན་པར་འདུ་བྱེད་པ་མེད་པར་སེམས་གནས་པ། སྨོན་པ་མེད་པའི་རྣམ་པར་ཐར་པའི་སྒོ་སྟེ།
en: “If you ask what is ‘aspirationlessness as a gateway to liberation,’ the state of mind in which all things are not formed, and there is nothing to be formed, is aspirationlessness as a gateway to liberation.

source: དེ་ནི་རྣམ་པར་ཐར་པའི་སྒོ་སྨོན་པ་མེད་པ་ཞེས་བྱའོ། །
en: This is called aspirationlessness as a gateway to liberation.

source: དེ་ལ་བསམ་གཏན་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ། དཔྱོད་པ་དང་བཅས་པ།
en: “If you ask what are the ‘four meditative concentrations,’ they are as follows: (1) Bodhisattvas achieve and maintain the first meditative concentration where there is freedom from desires, and freedom from negative and non-virtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom.

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་པ་དང་། དེ་རྟོག་པ་དང་། དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ། དཔྱོད་པ་མེད་པ།
en: (2) They achieve and maintain the second meditative concentration where there is an intense inner clarity, free from both ideation and scrutiny, the absence of ideation and scrutiny being due to one-pointed mental focus, while the joy and bliss that arise from meditative stability are present.

source: ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ། གནས་པ་དང་། དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: (3) They achieve and maintain the third meditative concentration where joy is absent, abiding in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present and bliss is experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དེ་ལ་དྲན་པ་དང་ལྡན་པ། བདེ་བ་དང་ལྡན་པ། བདེ་བ་ལ་གནས་པ། བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ།
en: This is what sublime beings describe as ‘mindful, blissful, abiding in bliss, and equanimous.’

source: དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ། གནས་པ་དང་། དེ་བདེ་བ་ཡང་སྤངས་ཏེ་སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་།
en: (4) They achieve and maintain the fourth meditative concentration where even that sense of bliss is abandoned and former states of suffering have also been eliminated.

source: ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་སྡུག་བསྔལ་ཡང་མ་ཡིན། བདེ་བ་ཡང་མ་ཡིན་པ། བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ།
en: Here, neither suffering nor bliss is present because blissful and unhappy states of mind have both subsided, while equanimity and mindfulness are utterly pure.

source: བསམ་གཏན་བཞི་པ་བསྒྲུབས་ནས་གནས་པ་སྟེ། དེ་དག་ནི་བསམ་གཏན་བཞི་ཞེས་བྱའོ། །
en: These are called the four meditative concentrations.

source: དེ་ལ་ཚད་མེད་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་།
en: “If you ask what are the ‘four immeasurable aspirations,’ they comprise (1) loving kindness, (2) compassion, (3) empathetic joy, and (4) equanimity.

source: བཏང་སྙོམས་ཏེ། དེ་དག་ནི་ཚད་མེད་པ་བཞི་ཞེས་བྱའོ། །
en: These are called the four immeasurable aspirations.

source: དེ་ལ་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་དང་།
en: “If you ask what are the ‘four formless meditative absorptions,’ they comprise (1) the meditative absorption of the sense field of infinite space, (2) the meditative absorption of the sense field of infinite consciousness, (3) the meditative absorption of the sense field of nothing-at-all, and (4) the meditative absorption of neither perception nor non-perception.

source: འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་དེ། དེ་དག་ནི་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཞེས་བྱའོ། །
en: These are called the four formless meditative absorptions.

source: དེ་ལ་རྣམ་པར་ཐར་པ་བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ། །
en: “If you ask what constitute the ‘eight aspects of liberation,’ they are as follows: (1) The first aspect of liberation ensues when corporeal beings observe physical forms [in order to compose the mind].

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས། ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་གཉིས་པའོ། །
en: (2) The second aspect of liberation ensues when formless beings endowed with internal perception observe external physical forms.

source: སྡུག་པ་ཉིད་དུ་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ། །
en: (3) The third aspect of liberation ensues when beings are inclined toward pleasant states.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: (4) The fourth aspect of liberation ensues when the perceptions of physical forms have been completely transcended in all respects, when the perceptions of obstructed phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and abides in the sense field of infinite space, thinking, ‘Space is infinite.’

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ། །
en: (5) The fifth aspect of liberation ensues when the sense field of infinite space has been completely transcended in all respects, and when one achieves and abides in the sense field of infinite consciousness, thinking, ‘Consciousness is infinite.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། ཅི་ཡང་མེད་དོ་སྙམ་ནས། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ། །
en: (6) The sixth aspect of liberation ensues when the sense field of infinite consciousness has been completely transcended in all respects, and one achieves and abides in the sense field of nothing-at-all, thinking, ‘There is nothing at all.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བདུན་པའོ། །
en: (7) The seventh aspect of liberation ensues when the sense field of nothing-at-all has been completely transcended in all respects, and one achieves and abides in the sense field of neither perception nor non-perception.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་པ་སྟེ།
en: (8) The eighth aspect of liberation ensues when the sense field of neither perception nor non-perception has been completely transcended in all respects, and one achieves and abides in the cessation of all perceptions and feelings.

source: དེ་དག་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་ཅེས་བྱའོ། །
en: These are called the eight aspects of liberation.

source: དེ་ལ་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། འདོད་པ་དག་ལས་དབེན་པ། སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ། རྟོག་པ་དང་བཅས་པ།
en: “If you ask what are the ‘nine serial steps of meditative absorption,’ they are as follows: (1) The first meditative absorption ensues when one achieves and maintains the first meditative concentration, that is to say, when there is freedom from desires, and freedom from negative and non-virtuous attributes, while ideation and scrutiny are present, alongside the joy and bliss that arise from freedom.

source: དཔྱོད་པ་དང་བཅས་པ། དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་དང་པོའོ། །དེ་རྟོག་པ་དང་དཔྱོད་པ་དང་བྲལ་ཞིང་ནང་ཡོངས་སུ་དང་སྟེ། སེམས་ཀྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པས་རྟོག་པ་མེད་པ།
en: (2) The second meditative absorption ensues when one achieves and maintains the second meditative concentration, that is to say, when there is an intense inner clarity, free from both ideation and scrutiny, the absence of ideation and scrutiny being due to one-pointed mental focus, while the joy and bliss that arise from meditative stability are present.

source: དཔྱོད་པ་མེད་པ། ཏིང་ངེ་འཛིན་ལས་སྐྱེས་པའི་དགའ་བ་དང་། བདེ་བ་ཅན་བསམ་གཏན་གཉིས་པ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་གཉིས་པའོ། །དེ་དགའ་བའི་འདོད་ཆགས་དང་བྲལ་བས་བཏང་སྙོམས་ལ་གནས་ཤིང་དྲན་པ་དང་ཤེས་བཞིན་ཅན་ཡིན་ཏེ། བདེ་བ་ལུས་ཀྱིས་མྱོང་ལ།
en: (3) The third meditative absorption ensues when one achieves and maintains the third meditative concentration, that is to say, when one abides in equanimity due to the absence of attachment to joy, while both mindfulness and alertness are present, and bliss is still experienced by the body.

source: འཕགས་པ་རྣམས་ཀྱིས་གང་དྲན་པ་དང་ལྡན་པ་བདེ་བ་ལ་གནས་པ་བཏང་སྙོམས་པའོ་ཞེས་བརྗོད་པ་སྟེ། དགའ་བ་མེད་པའི་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་གསུམ་པའོ། །
en: This is what sublime beings describe as ‘mindful, blissful, abiding in bliss, and equanimous.’

source: དེ་བདེ་བ་ཡང་སྤངས་ཏེ། སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་། ཡིད་མི་བདེ་བ་ནུབ་པས་སྡུག་བསྔལ་བ་ཡང་མ་ཡིན།
en: (4) The fourth meditative absorption ensues when one achieves and maintains the fourth meditative concentration, that is to say, when even that sense of bliss is abandoned and former states of suffering have also been eliminated.

source: བདེ་བ་ཡང་མ་ཡིན་པ་བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་བཞི་པའོ། །
en: Here, neither suffering nor bliss is present because blissful and unhappy states of mind have both subsided, while equanimity and mindfulness are utterly pure.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ། ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་ལྔ་པའོ། །དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: (5) The fifth meditative absorption ensues when the perceptions of physical forms have been completely transcended in all respects, when the perceptions of obstructed, material phenomena have subsided, and the mind does not engage with diverse perceptions, so that one achieves and abides in the sense field of infinite space, thinking, ‘Space is infinite.’

source: རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་དྲུག་པའོ། །
en: (6) The sixth meditative absorption ensues when the sense field of infinite space has been completely transcended in all respects, and when one achieves and abides in the sense field of infinite consciousness, thinking, ‘Consciousness is infinite.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། ཅི་ཡང་མེད་དོ་སྙམ་ནས། ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་བདུན་པའོ། །
en: (7) The seventh meditative absorption ensues when the sense field of infinite consciousness has been completely transcended in all respects, and one achieves and abides in the sense field of nothing-at-all, thinking, ‘There is nothing at all.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་བརྒྱད་པའོ། །
en: (8) The eighth meditative absorption ensues when the sense field of nothing-at-all has been completely transcended in all respects, and one achieves and abides in the sense field of neither perception nor non-perception.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་བསྒྲུབས་ཏེ་གནས་པ་འདི་ནི་སྙོམས་པར་འཇུག་པ་དགུ་པ་སྟེ།
en: (9) The ninth meditative absorption ensues when the sense field of neither perception nor non-perception has been completely transcended in all respects, and one achieves and abides in the cessation of all perceptions and feelings.

source: དེ་དག་ནི་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ཞེས་བྱའོ། །དེ་ལ་འདུ་ཤེས་དགུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། རྣམ་པར་བམ་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འབུས་གཞིགས་པའི་འདུ་ཤེས་དང་།
en: These are called the nine serial steps of meditative absorption.

source: རྣམ་པར་དམར་བའི་འདུ་ཤེས་དང་། རྣམ་པར་རྣགས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་སྔོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་ཟོས་པའི་འདུ་ཤེས་དང་། རྣམ་པར་འཐོར་བའི་འདུ་ཤེས་དང་། རུས་གོང་གི་འདུ་ཤེས་དང་། རྣམ་པར་ཚིག་པའི་འདུ་ཤེས་ཏེ།
en: “If you ask what are the ‘nine contemplations of impurity,’ they are as follows: (1) contemplation of a bloated corpse, (2) contemplation of a worm-infested corpse, (3) contemplation of a bloody corpse, (4) contemplation of a putrefied corpse, (5) contemplation of a blue-black corpse, (6) contemplation of a devoured corpse, (7) contemplation of a dismembered corpse, (8) contemplation of a skeleton, and (9) contemplation of an immolated corpse.

source: དེ་དག་ནི་འདུ་ཤེས་དགུ་ཞེས་བྱའོ། །དེ་ལ་རྗེས་སུ་དྲན་པ་བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་དང་། ཆོས་རྗེས་སུ་དྲན་པ་དང་།
en: These are called the nine contemplations of impurity.

source: དགེ་འདུན་རྗེས་སུ་དྲན་པ་དང་། ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་དང་། གཏོང་བ་རྗེས་སུ་དྲན་པ་དང་། ལྷ་རྗེས་སུ་དྲན་པ་དང་། ཉེ་བར་ཞི་བ་རྗེས་སུ་དྲན་པ་དང་། དབུགས་འབྱུང་བ་དང་རྔུབ་པ་རྗེས་སུ་དྲན་པ་དང་།
en: “If you ask what are the ‘ten recollections,’ they are as follows: (1) recollection of the Buddha, (2) recollection of the Dharma, (3) recollection of the Saṅgha, (4) recollection of ethical discipline, (5) recollection of renunciation, (6) recollection of the god realms, (7) recollection of quiescence, (8) recollection of respiration, (9) recollection of physicality, and (10) recollection of death.

source: ལུས་སུ་གཏོགས་པ་རྗེས་སུ་དྲན་པ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་སྟེ། དེ་དག་ནི་རྗེས་སུ་དྲན་པ་བཅུ་ཞེས་བྱའོ། །
en: These are called the ten recollections.

source: དེ་ལ་འདུ་ཤེས་ཀྱི་རྣམ་པ་དྲུག་གང་ཞེ་ན། འདི་ལྟ་སྟེ། མི་རྟག་པའི་འདུ་ཤེས་དང་། སྡུག་བསྔལ་བའི་འདུ་ཤེས་དང་། བདག་མེད་པའི་འདུ་ཤེས་དང་།
en: “If you ask what are the ‘six aspects of perception,’ they are as follows: (1) perception of impermanence, (2) perception of suffering, (3) perception of non-self, (4) perception of unattractiveness, (5) perception of death, and (6) perception of disinterest in all mundane things.

source: མི་སྡུག་པའི་འདུ་ཤེས་དང་། འཆི་བའི་འདུ་ཤེས་དང་། འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་པར་མི་དགའ་བའི་འདུ་ཤེས་ཏེ། དེ་དག་ནི་འདུ་ཤེས་ཀྱི་རྣམ་པ་དྲུག་ཅེས་བྱའོ། །
en: These are called the six aspects of perception.

source: དེ་ལ་ཆོས་ཤེས་པ་གང་ཞེ་ན། ཕུང་པོ་ལྔ་པོ་རྣམས་ཡོངས་སུ་སྦྱང་བ་བྱ་བ་ལ་ཡོངས་སུ་གཅོད་པའི་ཤེས་པ་གང་ཡིན་པ་སྟེ།
en: “If you ask what is the ‘knowledge of phenomena,’ it is the limited understanding that the five psycho-physical aggregates are to be purified.

source: དེ་ནི་ཆོས་ཤེས་པ་ཞེས་བྱའོ། །
en: This is called knowledge of phenomena.
